fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ЗадолженностьПоОбслуживанию</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/CommonModules/ВКМ_МассовоеСозданиеРеализаций/Module.bsl
#Область ПрограммныйИнтерфейс 

// Выполнить создание реализаций.
// 
// Параметры:
//  Период - Дата - период выбранный на форме
// 
// Возвращаемое значение:
//  Неопределено, Массив - Массив из Структуры
//     * Договор - Справочник.ВидДоговоров - договор по которому создается документ
//     * Ссылка - ДокументСсылка.РеализацияТоваровУслуг 
//     * Строка - Сторка со значением "новый"
Функция ВыполнитьСозданиеРеализаций(Период) Экспорт 
	
	НачалоПериода = Период.ДатаНачала; 
	КонецПериода = Период.ДатаОкончания; 
	ДокументыРеализации = Новый Массив;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговора КАК ДатаНачалаДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора КАК ДатаОкончанияДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка)
	|			И (РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца)
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("КонецМесяца", КонецПериода);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ДокументыРеализации = Неопределено;
	КонецЕсли; 
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ДатаНачалаДоговора > НачалоПериода Или ВыборкаДетальныеЗаписи.ДатаОкончанияДоговора < НачалоДня(КонецПериода) Тогда
			Продолжить;
		Иначе
			НовыйДокумент = Новый Структура;
			НовыйДокумент.Вставить("Договор", ВыборкаДетальныеЗаписи.Договор);
			НовыйДокумент.Вставить("Ссылка", ВКМ_МассовоеСозданиеРеализаций.ВыполнитьАвтозаполнение(КонецПериода, ВыборкаДетальныеЗаписи.Договор,
			ВыборкаДетальныеЗаписи.Контрагент)); 
			НовыйДокумент.Вставить("Статус","Новый");
			ДокументыРеализации.Добавить(НовыйДокумент);
		КонецЕсли;	
	КонецЦикла; 
		
	Возврат ДокументыРеализации;
КонецФункции 

// Функция создание документов "реализация товаров услуг" за указанный период
// Параметры:
//  КонецПериода - Дата - дата создания документов реализации из обработки "Массовое создание актов" 
//  Договор - СправочникСсылка.ДоговорыКонтрагентов - договор с контрагентом по которому создается документ Реализация товаров услуг
//  Контрагент - СправочникСсылка.Контрагенты - контрагент для которого создается документ реализации товаров услуг 
// Возвращаемое значение:	
//   ДокументСсылка - ДокументСсылка.РеализацияТоваровУслуг - ссылка на созданный Документ Реализации товаров услуг
Функция  ВыполнитьАвтозаполнение (КонецПериода, Договор, Контрагент) Экспорт
	
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент КАК Клиент,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовПриход, 0) КАК Часы,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеПриход, 0) КАК Сумма,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор.Организация КАК Организация,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор.ВКМ_АбонентскаяПлата, 0) КАК АбонентскаяПлата,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор.ВКМ_СтоимостьЧасаРаботыСпециалиста, 0) КАК ЦенаЧаса
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			Клиент = &Контрагент
	|				И Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(КонецПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ДоговорыКонтрагентов.ВКМ_АбонентскаяПлата, 0) КАК АбонентскаяПлата,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Договор";
		Запрос.УстановитьПараметр("Договор", Договор);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.АбонентскаяПлата = 0  Тогда
				Продолжить;
			Иначе	
				Реализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				Реализация.Дата = КонецПериода;
				Реализация.Договор = Договор;
				Реализация.Организация = ВыборкаДетальныеЗаписи.Организация;
				Реализация.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
				Реализация.Ответственный = Пользователи.ТекущийПользователь();
				НоваяСтрока = Реализация.Услуги.Добавить();
				НоваяСтрока.Номенклатура = НоменклатураАбонентскаяПлата;
				НоваяСтрока.Количество = 1;
				НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.АбонентскаяПлата;
				НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.АбонентскаяПлата; 
				Реализация.СуммаДокумента = Реализация.Услуги.Итог("Сумма");
			КонецЕсли; 
		КонецЦикла;
		
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.АбонентскаяПлата = 0 Тогда
				Продолжить;
			Иначе	
				Реализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				Реализация.Дата = КонецПериода;
				Реализация.Договор = Выборка.Договор;
				Реализация.Организация = Выборка.Организация;
				Реализация.Контрагент = Выборка.Клиент;
				Реализация.Ответственный = Пользователи.ТекущийПользователь();
				НоваяСтрока = Реализация.Услуги.Добавить();
				НоваяСтрока.Номенклатура = НоменклатураАбонентскаяПлата;
				НоваяСтрока.Количество = 1;
				НоваяСтрока.Цена = Выборка.АбонентскаяПлата;
				НоваяСтрока.Сумма = Выборка.АбонентскаяПлата;
			КонецЕсли;  
			Если Выборка.Сумма = 0 Тогда
				Продолжить;
			Иначе
				НоваяСтрока = Реализация.Услуги.Добавить();
				
				НоваяСтрока.Номенклатура = НоменклатураРаботыСпециалиста;
				НоваяСтрока.Количество = Выборка.Часы;
				НоваяСтрока.Цена = Выборка.ЦенаЧаса;
				НоваяСтрока.Сумма = Выборка.Сумма;		
			КонецЕсли; 
			Реализация.СуммаДокумента = Реализация.Услуги.Итог("Сумма");
			
		КонецЦикла; 
	КонецЕсли; 
	Если Не Реализация.ПроверитьЗаполнение() Тогда
		Отказ = Истина;
		Возврат Неопределено; 
	КонецЕсли;
	
	Реализация.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Реализация.Ссылка;
КонецФункции

#КонецОбласти
